"""Логирование уроков."""

# 23.07.2024
# 1. разобрали диаграммы Эйллера-Вена, рассмотрели виды чисел, множества и их взаимодействия(Пересечение, симметрическая разность, вхождение) Рассмотрели некоторые условные обозначения. Пример с ростом, весом, обхватом шеи как векторов. Формула косинусного сходства.
# 2. Первичное знакомство с гитхаб, кагл, ods.
# 3. Понятие векторов (направленный отрезок в системе координат)

# 24.07.2024
# Мощная регистрация на kaggle

# 02.08.2024
# 1. Понятие множества. Подмножества. Обсуждение XOR.
# 2. Повторение множества чисел.
# 3. Понятие мощности множества.
# 4. Повторение операций(действий) с множествами.
# 5. Понятие Декартова произведения.
# 6. Понятие отображения множеств. Образ и прообраз.
# 7. Понятие биекции, сюръекции, инъекции.
# 8. Понятие функции. Зависимая и независимая переменные.
# 9. Область определения и область значения функции.
# 10. Обратное отображение.

# 07.08.2024
# 1. Композиция отображений. Функция от функции.
# 2. Основы мат. логики. Высказывание. Логические операции над высказываниями (отрицание, конъюнкция, дизъюнкция) Импликация.
# 3. Битовые операции. Тильда. XOR.

# 09.08.2024
# 1. Понятие логического следствия. Разница между импликацией и следствием.
# 2. Теорема - логическое следствие. Гипотеза - недоказанное предположение.
# 3. Необходимость и достаточность для логического следствия.
# 4. Эквиваленция.
# 5. Понятие алгебраической структуры.
# 6. Бинарная операция.
# 7. Полугруппа. Группа.

# 15.08.2024
# 1. Алгебраические структуры:
# - Кольцо
# - Поле
# - Моноид
# - Полугруппы
# - Группы
# - Абелева группа
# 2. Мультипликативность и аддитивность
# 3. Коммутативность и ассоциативность структур
# 4. НОК, НОД.
# 5. Единичный элемент слева и справа. Единичный элемент.

# 19.08.2024
# 1. Предел последовательности. Введение в дифф. исчесление. Основные понятия.
# 2. Последовательности. Их свойства. Способы задания последовательности.
# 3. Геометрическое изображение последовательности. Постоянная последовательность.
# 4. Ограниченная сверху и снизу последовательность.
# 5. Связи бесконечно больших и бесконечно малых последовательностей.
# 6. Предел числовой последовательности. Эпсилон значение.

# 20.08.2024
# 1. Система множеств.
# 2. Отображение множеств. Преобразование. Морфизм.
# 3. Образ множества при отображении.
# 4. Суперпозиция функций.
# 5. Алгебраическая структура действительнных чисел. Поле действительных чисел.
# 6. Метод математической индукции.

# 24.08.2024
# 1. Инъекция. Сюръекция в кванторном виде.
# 2. Образ и прообраз.
# 3. Сужение отображения.
# 4. Понятие функции. Способы задания функции.
# 5. Области определения и значения.
# 6. Графики элементарных функций.
# 7. Способы задания функции.
# 8. Алегбраические структуры. Группа диэдра.
# 9. Подгруппа.

# 26.08.2024
# 1. Предел. Четность и нечетность функции.
# 2. Графики тригонометрических функций (синус, косинус, тангенс, котангенс, арксинус, арккосинус, арктангенс, арккатангенс) Их области определения и значения.
# 3. Алгебраические структуры.
# 4. Подгруппа, ее свойства.

# 27.08.2024
# 1. Ограниченные сверху и снизу множества.
# 2. Верхняя и нижняя грань числового множества. Supremum. Infinum.
# 3. Арифметическая разность и сумма множеств.
# 4. Принцип Архимеда.
# 5. Принцип Вложенных отрезков.
#

# 31.08.2024
# 1. Сходящаяся и расходящаяся последовательность.
# 2. Бесконечно малая и бесконечно большая последовательности.
# 3. Свойства бесконечно малых последовательностей.
# 4. Свойства сходящихся последовательностей.
# 5. Решение пределов.

# 02.09.2024
# 1. Решение пределов
# 2. Бесконечно малая эквивалентность
# 3. Замечательные пределы
# 4. "Мигалки"
# 5. Элементарные функции. Четность нечетность функции

# 03.09.2024
# 1. Сжатие, растяжение, смещение функций по осям абсцисс, ординат
# 2. Метод выделения полного квадрата. Алгоритм.
# 3. Графики функций с модулем.
# 4. Асимптоты графика функций
# 5. Установления наличия асимптот
# 6. Нахождение асимптот графика функции

# 05.09.2024
# 1. Нули функции. Интервалы знака постоянства.
# 2. Алгоритм метода интервалов.
# 3. Возрастание, убывание и экстремумы функции.
# 4. Монотонность. Точки минимума, максимума.
# 5. Исследование функций. Критические точки.

# 09.10.2024
# 1. Предел последовательности по Коши, Гейне.
# 2. Решение предела через определение.
# 3. Односторонние, двусторонние пределы.

# 10.10.2024
# 1. Решение пределов методом умножения числителя и знаменателя на сопряженное выражение
# 2. Монотонная функция и ее пределы
# 3. Замечательные пределы

# 12.10.2024
# 1. Решение пределов
